# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [1]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [2]:
df = pd.DataFrame(data)

In [3]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [4]:
df.groupby('Company')

You can save this object as a new variable:

In [5]:
by_comp = df.groupby("Company")

And then call aggregate methods off the object:

In [6]:
#dir(by_comp)
by_comp.mean(numeric_only=True)

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [7]:
df.groupby('Company').mean(numeric_only=True)

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

More examples of aggregate methods:

In [8]:
by_comp.std(numeric_only=True)

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [9]:
by_comp.min(numeric_only=True)

         Sales
Company
FB         243
GOOG       120
MSFT       124

In [10]:
by_comp.max(numeric_only=True)

         Sales
Company
FB         350
GOOG       200
MSFT       340

In [11]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [12]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [13]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [14]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

# Great Job!

In [15]:
doc = {'shops':['KS','KS','NS','NS','AK','AK'],
       'product':['apple','orange','cherry','berry','kiwi','mango'],
       'price':[200,120,340,124,243,350]}

In [16]:
y= pd.DataFrame(doc)

In [17]:
y

  shops product  price
0    KS   apple    200
1    KS  orange    120
2    NS  cherry    340
3    NS   berry    124
4    AK    kiwi    243
5    AK   mango    350

In [18]:
y.groupby('shops')

In [19]:
y.groupby('shops').sum(numeric_only=True)

       price
shops
AK       593
KS       320
NS       464

In [20]:
y.groupby('shops').mean(numeric_only=True)

       price
shops
AK     296.5
KS     160.0
NS     232.0

In [21]:
y.groupby('shops').min(numeric_only=True)

       price
shops
AK       243
KS       120
NS       124

In [22]:
y.groupby('shops').max(numeric_only=True)

       price
shops
AK       350
KS       200
NS       340

In [23]:
y.count()

shops      6
product    6
price      6
dtype: int64

In [24]:
y.groupby('shops').std(numeric_only=True)

            price
shops
AK      75.660426
KS      56.568542
NS     152.735065

In [25]:
y.describe()

            price
count    6.000000
mean   229.500000
std    100.899455
min    120.000000
25%    143.000000
50%    221.500000
75%    315.750000
max    350.000000

In [26]:
y.describe().transpose()

       count   mean         std    min    25%    50%     75%    max
price    6.0  229.5  100.899455  120.0  143.0  221.5  315.75  350.0

In [29]:
y.groupby('shops').describe().transpose()[['NS']]

shops                NS
price count    2.000000
      mean   232.000000
      std    152.735065
      min    124.000000
      25%    178.000000
      50%    232.000000
      75%    286.000000
      max    340.000000